#+title: Notes

A REPL is:
4. Loop
   1. Read
   2. Eval
   3. Print


* List of stuff to do
** TODO Abstract out the input handling.

#+begin_src rust
println!("Hello world");
#+end_src

#+RESULTS:
: Hello world


#+begin_src python
return "HELLO"
#+end_src

#+RESULTS:
: HELLO
